{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<repo_name>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<reponame>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<file_sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<filename>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<gh_stars>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<issue_start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<issue_comment>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "<issue_closed>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "<jupyter_start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "<jupyter_text>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "<jupyter_code>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "<jupyter_output>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "<jupyter_script>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "<empty_output>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49152,
      "content": "<global-img>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49153,
      "content": "<row_1_col_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49154,
      "content": "<row_1_col_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49155,
      "content": "<row_1_col_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49156,
      "content": "<row_1_col_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49157,
      "content": "<row_1_col_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49158,
      "content": "<row_1_col_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49159,
      "content": "<row_2_col_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49160,
      "content": "<row_2_col_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49161,
      "content": "<row_2_col_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49162,
      "content": "<row_2_col_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49163,
      "content": "<row_2_col_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49164,
      "content": "<row_2_col_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49165,
      "content": "<row_3_col_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49166,
      "content": "<row_3_col_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49167,
      "content": "<row_3_col_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49168,
      "content": "<row_3_col_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49169,
      "content": "<row_3_col_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49170,
      "content": "<row_3_col_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49171,
      "content": "<row_4_col_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49172,
      "content": "<row_4_col_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49173,
      "content": "<row_4_col_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49174,
      "content": "<row_4_col_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49175,
      "content": "<row_4_col_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49176,
      "content": "<row_4_col_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49177,
      "content": "<row_5_col_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49178,
      "content": "<row_5_col_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49179,
      "content": "<row_5_col_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49180,
      "content": "<row_5_col_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49181,
      "content": "<row_5_col_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49182,
      "content": "<row_5_col_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49183,
      "content": "<row_6_col_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49184,
      "content": "<row_6_col_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49185,
      "content": "<row_6_col_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49186,
      "content": "<row_6_col_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49187,
      "content": "<row_6_col_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49188,
      "content": "<row_6_col_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49189,
      "content": "<fake_token_around_image>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49190,
      "content": "<image>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49191,
      "content": "<|reserved_special_token_0|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49192,
      "content": "<|reserved_special_token_1|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49193,
      "content": "<|reserved_special_token_2|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49194,
      "content": "<|reserved_special_token_3|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49195,
      "content": "<|reserved_special_token_4|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49196,
      "content": "<|reserved_special_token_5|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49197,
      "content": "<|reserved_special_token_6|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49198,
      "content": "<|reserved_special_token_7|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49199,
      "content": "<|reserved_special_token_8|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49200,
      "content": "<|reserved_special_token_9|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49201,
      "content": "<|reserved_special_token_10|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49202,
      "content": "<|reserved_special_token_11|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49203,
      "content": "<|reserved_special_token_12|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49204,
      "content": "<|reserved_special_token_13|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49205,
      "content": "<|reserved_special_token_14|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49206,
      "content": "<|reserved_special_token_15|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49207,
      "content": "<|reserved_special_token_16|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49208,
      "content": "<|reserved_special_token_17|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49209,
      "content": "<|reserved_special_token_18|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49210,
      "content": "<|reserved_special_token_19|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49211,
      "content": "<|reserved_special_token_20|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49212,
      "content": "<|reserved_special_token_21|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49213,
      "content": "<|reserved_special_token_22|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49214,
      "content": "<|reserved_special_token_23|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49215,
      "content": "<|reserved_special_token_24|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49216,
      "content": "<|reserved_special_token_25|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49217,
      "content": "<|reserved_special_token_26|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49218,
      "content": "<|reserved_special_token_27|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49219,
      "content": "<|reserved_special_token_28|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49220,
      "content": "<|reserved_special_token_29|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49221,
      "content": "<|reserved_special_token_30|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49222,
      "content": "<|reserved_special_token_31|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49223,
      "content": "<|reserved_special_token_32|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49224,
      "content": "<|reserved_special_token_33|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49225,
      "content": "<|reserved_special_token_34|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49226,
      "content": "<|reserved_special_token_35|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49227,
      "content": "<|reserved_special_token_36|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49228,
      "content": "<|reserved_special_token_37|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49229,
      "content": "<|reserved_special_token_38|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49230,
      "content": "<|reserved_special_token_39|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49231,
      "content": "<|reserved_special_token_40|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49232,
      "content": "<|reserved_special_token_41|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49233,
      "content": "<|reserved_special_token_42|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49234,
      "content": "<|reserved_special_token_43|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49235,
      "content": "<|reserved_special_token_44|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49236,
      "content": "<|reserved_special_token_45|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49237,
      "content": "<|reserved_special_token_46|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49238,
      "content": "<|reserved_special_token_47|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49239,
      "content": "<|reserved_special_token_48|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49240,
      "content": "<|reserved_special_token_49|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49241,
      "content": "<|reserved_special_token_50|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49242,
      "content": "<|reserved_special_token_51|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49243,
      "content": "<|reserved_special_token_52|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49244,
      "content": "<|reserved_special_token_53|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49245,
      "content": "<|reserved_special_token_54|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49246,
      "content": "<|reserved_special_token_55|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49247,
      "content": "<|reserved_special_token_56|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49248,
      "content": "<|reserved_special_token_57|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49249,
      "content": "<|reserved_special_token_58|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49250,
      "content": "<|reserved_special_token_59|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49251,
      "content": "<|reserved_special_token_60|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49252,
      "content": "<|reserved_special_token_61|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49253,
      "content": "<|reserved_special_token_62|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49254,
      "content": "<|reserved_special_token_63|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49255,
      "content": "<|reserved_special_token_64|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49256,
      "content": "<|reserved_special_token_65|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49257,
      "content": "<|reserved_special_token_66|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49258,
      "content": "<|reserved_special_token_67|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49259,
      "content": "<|reserved_special_token_68|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49260,
      "content": "<|reserved_special_token_69|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49261,
      "content": "<|reserved_special_token_70|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49262,
      "content": "<|reserved_special_token_71|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49263,
      "content": "<|reserved_special_token_72|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49264,
      "content": "<|reserved_special_token_73|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49265,
      "content": "<|reserved_special_token_74|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49266,
      "content": "<|reserved_special_token_75|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49267,
      "content": "<|reserved_special_token_76|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49268,
      "content": "<|reserved_special_token_77|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49269,
      "content": "<|reserved_special_token_78|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49270,
      "content": "<|reserved_special_token_79|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49271,
      "content": "<|reserved_special_token_80|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49272,
      "content": "<|reserved_special_token_81|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49273,
      "content": "<|reserved_special_token_82|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49274,
      "content": "<|reserved_special_token_83|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49275,
      "content": "<|reserved_special_token_84|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49276,
      "content": "<|reserved_special_token_85|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49277,
      "content": "<|reserved_special_token_86|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49278,
      "content": "<|reserved_special_token_87|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49279,
      "content": "<end_of_utterance>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|im_start|>": 1,
      "<|im_end|>": 2,
      "<repo_name>": 3,
      "<reponame>": 4,
      "<file_sep>": 5,
      "<filename>": 6,
      "<gh_stars>": 7,
      "<issue_start>": 8,
      "<issue_comment>": 9,
      "<issue_closed>": 10,
      "<jupyter_start>": 11,
      "<jupyter_text>": 12,
      "<jupyter_code>": 13,
      "<jupyter_output>": 14,
      "<jupyter_script>": 15,
      "<empty_output>": 16,
      "!": 17,
      "\"": 18,
      "#": 19,
      "$": 20,
      "%": 21,
      "&": 22,
      "'": 23,
      "(": 24,
      ")": 25,
      "*": 26,
      "+": 27,
      ",": 28,
      "-": 29,
      ".": 30,
      "/": 31,
      "0": 32,
      "1": 33,
      "2": 34,
      "3": 35,
      "4": 36,
      "5": 37,
      "6": 38,
      "7": 39,
      "8": 40,
      "9": 41,
      ":": 42,
      ";": 43,
      "<": 44,
      "=": 45,
      ">": 46,
      "?": 47,
      "@": 48,
      "A": 49,
      "B": 50,
      "C": 51,
      "D": 52,
      "E": 53,
      "F": 54,
      "G": 55,
      "H": 56,
      "I": 57,
      "J": 58,
      "K": 59,
      "L": 60,
      "M": 61,
      "N": 62,
      "O": 63,
      "P": 64,
      "Q": 65,
      "R": 66,
      "S": 67,
      "T": 68,
      "U": 69,
      "V": 70,
      "W": 71,
      "X": 72,
      "Y": 73,
      "Z": 74,
      "[": 75,
      "\\": 76,
      "]": 77,
      "^": 78,
      "_": 79,
      "`": 80,
      "a": 81,
      "b": 82,
      "c": 83,
      "d": 84,
      "e": 85,
      "f": 86,
      "g": 87,
      "h": 88,
      "i": 89,
      "j": 90,
      "k": 91,
      "l": 92,
      "m": 93,
      "n": 94,
      "o": 95,
      "p": 96,
      "q": 97,
      "r": 98,
      "s": 99,
      "t": 100,
      "u": 101,
      "v": 102,
      "w": 103,
      "x": 104,
      "y": 105,
      "z": 106,
      "{": 107,
      "|": 108,
      "}": 109,
      "~": 110,
      "¡": 111,
      "¢": 112,
      "£": 113,
      "¤": 114,
      "¥": 115,
      "¦": 116,
      "§": 117,
      "¨": 118,
      "©": 119,
      "ª": 120,
      "«": 121,
      "¬": 122,
      "®": 123,
      "¯": 124,
      "°": 125,
      "±": 126,
      "²": 127,
      "³": 128,
      "´": 129,
      "µ": 130,
      "¶": 131,
      "·": 132,
      "¸": 133,
      "¹": 134,
      "º": 135,
      "»": 136,
      "¼": 137,
      "½": 138,
      "¾": 139,
      "¿": 140,
      "Â": 141,
      "Ã": 142,
      "Ä": 143,
      "Å": 144,
      "Æ": 145,
      "Ç": 146,
      "È": 147,
      "É": 148,
      "Ê": 149,
      "Ë": 150,
      "Ì": 151,
      "Í": 152,
      "Î": 153,
      "Ï": 154,
      "Ð": 155,
      "Ñ": 156,
      "Ò": 157,
      "Ó": 158,
      "Ô": 159,
      "Õ": 160,
      "Ö": 161,
      "×": 162,
      "Ø": 163,
      "Ù": 164,
      "Ú": 165,
      "Û": 166,
      "Ü": 167,
      "Ý": 168,
      "Þ": 169,
      "ß": 170,
      "à": 171,
      "á": 172,
      "â": 173,
      "ã": 174,
      "ä": 175,
      "å": 176,
      "æ": 177,
      "ç": 178,
      "è": 179,
      "é": 180,
      "ê": 181,
      "ë": 182,
      "ì": 183,
      "í": 184,
      "î": 185,
      "ï": 186,
      "ð": 187,
      "ó": 188,
      "ô": 189,
      "Ā": 190,
      "ā": 191,
      "Ă": 192,
      "ă": 193,
      "ą": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ĕ": 207,
      "ė": 208,
      "Ę": 209,
      "ę": 210,
      "Ě": 211,
      "ě": 212,
      "Ĝ": 213,
      "Ğ": 214,
      "ğ": 215,
      "Ġ": 216,
      "ġ": 217,
      "Ģ": 218,
      "ģ": 219,
      "Ĥ": 220,
      "ĥ": 221,
      "Ħ": 222,
      "ħ": 223,
      "Ĩ": 224,
      "ĩ": 225,
      "Ī": 226,
      "ī": 227,
      "Ĭ": 228,
      "ĭ": 229,
      "Į": 230,
      "į": 231,
      "İ": 232,
      "ı": 233,
      "Ĳ": 234,
      "ĳ": 235,
      "Ĵ": 236,
      "ĵ": 237,
      "Ķ": 238,
      "ķ": 239,
      "ĸ": 240,
      "Ĺ": 241,
      "ĺ": 242,
      "Ļ": 243,
      "ļ": 244,
      "Ľ": 245,
      "ľ": 246,
      "Ŀ": 247,
      "ŀ": 248,
      "Ł": 249,
      "ł": 250,
      "Ń": 251,
      "Ġt": 252,
      "Ġa": 253,
      "in": 254,
      "he": 255,
      "ĠĠ": 256,
      "re": 257,
      "on": 258,
      "er": 259,
      "Ġthe": 260,
      "at": 261,
      "Ġs": 262,
      "Ġo": 263,
      "en": 264,
      "Ġc": 265,
      "es": 266,
      "Ġw": 267,
      "nd": 268,
      "it": 269,
      "or": 270,
      "is": 271,
      "al": 272,
      "Ġp": 273,
      "ing": 274,
      "Ġf": 275,
      "an": 276,
      "ed": 277,
      "Ġb": 278,
      "ou": 279,
      "ar": 280,
      "Ġin": 281,
      "Ġof": 282,
      "Ġm": 283,
      "Ġand": 284,
      "ion": 285,
      "ic": 286,
      "Ġd": 287,
      "Ġto": 288,
      "ĠĠĠĠ": 289,
      "le": 290,
      "ro": 291,
      "as": 292,
      "ent": 293,
      "Ġh": 294,
      "Ġth": 295,
      "ct": 296,
      "Ġe": 297,
      "Ġre": 298,
      "el": 299,
      "om": 300,
      "il": 301,
      "st": 302,
      "Ġl": 303,
      "Ġn": 304,
      "et": 305,
      "im": 306,
      "ve": 307,
      "ol": 308,
      "ation": 309,
      "Ġg": 310,
      "id": 311,
      "ĠT": 312,
      "se": 313,
      "Ġis": 314,
      "ur": 315,
      "ut": 316,
      "ra": 317,
      "ly": 318,
      "ce": 319,
      "ot": 320,
      "âĢ": 321,
      "ch": 322,
      "ow": 323,
      "ig": 324,
      "Ġbe": 325,
      "Ġu": 326,
      "Ġfor": 327,
      "Ġst": 328,
      "Ġy": 329,
      "ĠA": 330,
      "ver": 331,
      "am": 332,
      "ĠĠĠ": 333,
      "ĠS": 334,
      "Ġon": 335,
      "ul": 336,
      "ir": 337,
      "Ġthat": 338,
      "ĠI": 339,
      "ĠC": 340,
      "ay": 341,
      "if": 342,
      "ith": 343,
      "ad": 344,
      "Ġcon": 345,
      "Ġyou": 346,
      "Ġas": 347,
      "Ġpro": 348,
      "her": 349,
      "od": 350,
      "Ġwith": 351,
      "ter": 352,
      "ĠĠĠĠĠĠĠĠ": 353,
      "Ġan": 354,
      "Ġor": 355,
      "Ġwh": 356,
      "Ġit": 357,
      "ment": 358,
      "Ġare": 359,
      "Ġal": 360,
      "ge": 361,
      "ess": 362,
      "ist": 363,
      "Ġex": 364,
      "Ġ(": 365,
      "ers": 366,
      "Ġde": 367,
      "ate": 368,
      "ab": 369,
      "ies": 370,
      "op": 371,
      "ĠM": 372,
      "th": 373,
      "ect": 374,
      "res": 375,
      "us": 376,
      "ĠP": 377,
      "ĠThe": 378,
      "Ġcom": 379,
      "iv": 380,
      "est": 381,
      "um": 382,
      "ity": 383,
      "Ġhe": 384,
      "qu": 385,
      "Ġv": 386,
      "ac": 387,
      "ill": 388,
      "ĠB": 389,
      "ore": 390,
      "em": 391,
      "Ġwe": 392,
      "Ġsu": 393,
      "pp": 394,
      "os": 395,
      "ke": 396,
      "and": 397,
      "rom": 398,
      "nt": 399,
      "ld": 400,
      "ort": 401,
      "ain": 402,
      "ant": 403,
      "ive": 404,
      "igh": 405,
      "oc": 406,
      "ĠH": 407,
      "ĠW": 408,
      "ial": 409,
      "Ġch": 410,
      "Ġby": 411,
      "Ġr": 412,
      "ud": 413,
      "ĠE": 414,
      "ĠĠĠĠĠĠĠ": 415,
      "Ġcan": 416,
      "âĢĻ": 417,
      "Ġat": 418,
      "un": 419,
      "Ġne": 420,
      "Ġha": 421,
      "ĠD": 422,
      "--": 423,
      "ure": 424,
      "Ġle": 425,
      "ĠF": 426,
      "Ġse": 427,
      "ĠR": 428,
      "Ġfrom": 429,
      "Ġen": 430,
      "ri": 431,
      "pe": 432,
      "ical": 433,
      "art": 434,
      "og": 435,
      "Ġwas": 436,
      "pt": 437,
      "ions": 438,
      "pl": 439,
      "rou": 440,
      "Ġnot": 441,
      "ĠN": 442,
      "Ġsh": 443,
      "Ġim": 444,
      "ight": 445,
      "Ġ=": 446,
      "out": 447,
      "ĊĠĠĠĠĠĠĠ": 448,
      "all": 449,
      "ĠL": 450,
      "Ġthis": 451,
      "ĠG": 452,
      "Ġab": 453,
      "ag": 454,
      "red": 455,
      "per": 456,
      "Ġhave": 457,
      "Ġwor": 458,
      "ĠâĢ": 459,
      "gh": 460,
      "our": 461,
      "ine": 462,
      "iz": 463,
      "Ġint": 464,
      "ome": 465,
      "ĊĠĠĠĠĠĠĠĠ": 466,
      "ust": 467,
      "Ġus": 468,
      "Ġyour": 469,
      "ould": 470,
      "act": 471,
      "ĊĠĠĠ": 472,
      "age": 473,
      "ost": 474,
      "Ġpl": 475,
      "Ġ\"": 476,
      "ard": 477,
      "ell": 478,
      "ther": 479,
      "Ġtheir": 480,
      "ult": 481,
      "elf": 482,
      "ated": 483,
      "ff": 484,
      "ich": 485,
      "end": 486,
      "ans": 487,
      "ous": 488,
      "ide": 489,
      "ru": 490,
      "ations": 491,
      "ĠO": 492,
      "Ġad": 493,
      "ak": 494,
      "Ġwhe": 495,
      "du": 496,
      "cl": 497,
      "Ġcont": 498,
      "Ġres": 499,
      "ast": 500,
      "Ġk": 501,
      "Ġthey": 502,
      "Ġcomp": 503,
      "The": 504,
      "ib": 505,
      "'s": 506,
      "orm": 507,
      "ip": 508,
      "cc": 509,
      "Ġdis": 510,
      "Ġall": 511,
      "ap": 512,
      "ame": 513,
      "ĠU": 514,
      "able": 515,
      "ong": 516,
      "ear": 517,
      "ere": 518,
      "ie": 519,
      "ass": 520,
      "Ġimp": 521,
      "are": 522,
      "Ġwill": 523,
      "ance": 524,
      "ĠTh": 525,
      "ind": 526,
      "Ġwhich": 527,
      "ood": 528,
      "ary": 529,
      "ĠJ": 530,
      "ual": 531,
      "vel": 532,
      "ĠIn": 533,
      "ep": 534,
      "ence": 535,
      "Ġdo": 536,
      "one": 537,
      "ks": 538,
      "Ġcl": 539,
      "Ġmore": 540,
      "ry": 541,
      "ia": 542,
      "Ġte": 543,
      "Ġj": 544,
      "ign": 545,
      "ue": 546,
      "ents": 547,
      "reat": 548,
      "Ġme": 549,
      "Ġother": 550,
      "Ġun": 551,
      "ile": 552,
      "Ġhas": 553,
      "ach": 554,
      "Ġman": 555,
      "ime": 556,
      "ction": 557,
      "ild": 558,
      "so": 559,
      "ress": 560,
      "ces": 561,
      "Ġar": 562,
      "Ġabout": 563,
      "Ġbut": 564,
      "av": 565,
      "Ġapp": 566,
      "Ġper": 567,
      "oo": 568,
      "ice": 569,
      "ition": 570,
      "ater": 571,
      "ely": 572,
      "âĢĿ": 573,
      "Ġsp": 574,
      "ake": 575,
      "ase": 576,
      "Ġev": 577,
      "Ġout": 578,
      "ors": 579,
      "ack": 580,
      "ens": 581,
      "Ġone": 582,
      "very": 583,
      "form": 584,
      "Ġif": 585,
      "----": 586,
      "ory": 587,
      "Ġso": 588,
      "ord": 589,
      "ace": 590,
      "int": 591,
      "Ġwere": 592,
      "ber": 593,
      "nder": 594,
      ").": 595,
      "Ġli": 596,
      "Ġalso": 597,
      "ount": 598,
      "Ġpart": 599,
      "Ġcomm": 600,
      "Ġthem": 601,
      "ose": 602,
      "au": 603,
      "ang": 604,
      "ci": 605,
      "Ġstud": 606,
      "con": 607,
      "rit": 608,
      "ire": 609,
      "Ġpe": 610,
      "ub": 611,
      "now": 612,
      "Ġqu": 613,
      "Ġup": 614,
      "Ġsy": 615,
      "ings": 616,
      "Ġwho": 617,
      "Ġinto": 618,
      "ĠâĢľ": 619,
      "ound": 620,
      "ish": 621,
      "Ġpre": 622,
      "Ġthese": 623,
      "Ġits": 624,
      "ĠSt": 625,
      "olog": 626,
      "iff": 627,
      "pec": 628,
      "ĊĠĠĠĠĠĠĠĠĠĠĠ": 629,
      "rough": 630,
      "ric": 631,
      "Ġfe": 632,
      "Ġbec": 633,
      "Ġsome": 634,
      "Ġtra": 635,
      "ail": 636,
      "Ġ'": 637,
      "Ġhow": 638,
      "Ġself": 639,
      "ree": 640,
      "Ġind": 641,
      "ities": 642,
      "),": 643,
      "king": 644,
      "Ġwhen": 645,
      "ays": 646,
      "ph": 647,
      "vers": 648,
      "Ġem": 649,
      "Ġhis": 650,
      "Ġro": 651,
      "ific": 652,
      "Ġour": 653,
      "Ġmay": 654,
      "Ġtime": 655,
      "Ġunder": 656,
      "ĠIt": 657,
      "ments": 658,
      "ĠK": 659,
      "ates": 660,
      "ople": 661,
      "ne": 662,
      "ite": 663,
      "Ġcol": 664,
      "Ġthere": 665,
      "Ġbet": 666,
      "urn": 667,
      "cre": 668,
      "ĠThis": 669,
      "Ġthan": 670,
      "ough": 671,
      "ys": 672,
      "Ġdiff": 673,
      "ating": 674,
      "ob": 675,
      "te": 676,
      "we": 677,
      "ĠCh": 678,
      "ath": 679,
      "ject": 680,
      "Ġtr": 681,
      "ally": 682,
      "low": 683,
      "erv": 684,
      "Ġgo": 685,
      "ms": 686,
      "Ġcons": 687,
      "Ġag": 688,
      "Ġra": 689,
      "Ġover": 690,
      "lect": 691,
      "Ġrec": 692,
      "xt": 693,
      "Ġpr": 694,
      "ple": 695,
      "tern": 696,
      "ian": 697,
      "Ġacc": 698,
      "Ġknow": 699,
      "cess": 700,
      "Ġpeople": 701,
      "Ġlike": 702,
      "ove": 703,
      "Ġhel": 704,
      "Ġact": 705,
      "ata": 706,
      "ons": 707,
      "Ġdes": 708,
      "lic": 709,
      "clud": 710,
      "ious": 711,
      "##": 712,
      "Ġyear": 713,
      "arn": 714,
      "Ġsuch": 715,
      "Ġrel": 716,
      "ĠV": 717,
      "ĠY": 718,
      "Ġbeen": 719,
      "row": 720,
      "ef": 721,
      "Ġuse": 722,
      "ren": 723,
      "Ġhelp": 724,
      "Ġnew": 725,
      "get": 726,
      "):": 727,
      "alth": 728,
      "irst": 729,
      "ert": 730,
      "Ġ-": 731,
      "Ġwhat": 732,
      "ause": 733,
      "eth": 734,
      "les": 735,
      "Ġwould": 736,
      "Ġneed": 737,
      "Ġthrough": 738,
      "ful": 739,
      "stem": 740,
      "uring": 741,
      "round": 742,
      "Ġsa": 743,
      "Ġam": 744,
      "Ġeff": 745,
      "Ġwork": 746,
      "ics": 747,
      "velop": 748,
      "ov": 749,
      "Ġany": 750,
      "ool": 751,
      "Ġimport": 752,
      "Ġdef": 753,
      "Ġbl": 754,
      "ular": 755,
      "ures": 756,
      "Ġass": 757,
      "Ġspec": 758,
      "Ġgen": 759,
      "Ġtw": 760,
      "Ġhad": 761,
      "rib": 762,
      "mer": 763,
      "ll": 764,
      "Ġinclud": 765,
      "ced": 766,
      "Ġoff": 767,
      "Ġmost": 768,
      "ise": 769,
      "hed": 770,
      "self": 771,
      "Ġprov": 772,
      "port": 773,
      "iss": 774,
      "ract": 775,
      "ange": 776,
      "Ġph": 777,
      "ict": 778,
      "Ġreg": 779,
      "ational": 780,
      "als": 781,
      "Ġdiffere": 782,
      "ility": 783,
      "Ġac": 784,
      "pect": 785,
      "oss": 786,
      "Ġno": 787,
      "In": 788,
      "oth": 789,
      "ook": 790,
      "ative": 791,
      "ark": 792,
      "old": 793,
      "Ġob": 794,
      "hen": 795,
      "Ġprodu": 796,
      "Ġinv": 797,
      "Ġmod": 798,
      "Ġdevelop": 799,
      "Ġmany": 800,
      "Ġdi": 801,
      "Ġrem": 802,
      "Ġadd": 803,
      "Ġused": 804,
      "Ġonly": 805,
      "Ġsc": 806,
      "fter": 807,
      "Ġfirst": 808,
      "ween": 809,
      "ĠUn": 810,
      "Ġchild": 811,
      "ible": 812,
      "ten": 813,
      "ram": 814,
      "uc": 815,
      "ĠâĢĵ": 816,
      "Ġsystem": 817,
      "arch": 818,
      "Ġatt": 819,
      "Ġget": 820,
      "ased": 821,
      "Ġinst": 822,
      "ower": 823,
      "com": 824,
      "cept": 825,
      "Ġbetween": 826,
      "Ġtwo": 827,
      "**": 828,
      "Ġret": 829,
      "ife": 830,
      "chn": 831,
      "Ġfl": 832,
      "erm": 833,
      "Ġinf": 834,
      "Ġlearn": 835,
      "ize": 836,
      "Ġwhere": 837,
      "Ġsur": 838,
      "wn": 839,
      "Ġsub": 840,
      "Ġexam": 841,
      "its": 842,
      "Ġinter": 843,
      "Ġpo": 844,
      "own": 845,
      "ew": 846,
      "ond": 847,
      "Ġpers": 848,
      "ts": 849,
      "Ġtrans": 850,
      "ps": 851,
      "hes": 852,
      "Ġpol": 853,
      "ble": 854,
      "Ġexper": 855,
      "Ġcould": 856,
      "Ġco": 857,
      "Ġsupp": 858,
      "ss": 859,
      "ution": 860,
      "Ġnum": 861,
      "ting": 862,
      "ng": 863,
      "Ġhealth": 864,
      "Ġsm": 865,
      "ty": 866,
      "ural": 867,
      "Ġshould": 868,
      "ern": 869,
      "gan": 870,
      "Ġstr": 871,
      "ever": 872,
      "cy": 873,
      "Ġher": 874,
      "ues": 875,
      "Ġwell": 876,
      "Ġbu": 877,
      "ily": 878,
      "stand": 879,
      "ident": 880,
      "erg": 881,
      "oci": 882,
      "Ġty": 883,
      "ines": 884,
      "ied": 885,
      "Ġval": 886,
      "Ġpres": 887,
      "ex": 888,
      "Ġexpl": 889,
      "__": 890,
      "Ġvar": 891,
      "fore": 892,
      "Ġrese": 893,
      "aking": 894,
      "Ġsim": 895,
      "Ġdifferent": 896,
      "Ġevery": 897,
      "ives": 898,
      "ology": 899,
      "ink": 900,
      "ick": 901,
      "Ġke": 902,
      "ade": 903,
      "Ġhigh": 904,
      "Ġworld": 905,
      "ature": 906,
      "Ġ#": 907,
      "Ġeven": 908,
      "ĠHe": 909,
      "Ġform": 910,
      "ists": 911,
      "aw": 912,
      "Ġwater": 913,
      "Ġsign": 914,
      "Ġjust": 915,
      "--------": 916,
      "ants": 917,
      "ism": 918,
      "Ġmake": 919,
      "vent": 920,
      "Ġexp": 921,
      "oy": 922,
      "',": 923,
      "ness": 924,
      "uch": 925,
      "ft": 926,
      "ins": 927,
      "iew": 928,
      "Ġyears": 929,
      "Ġref": 930,
      "ds": 931,
      "Ġset": 932,
      "Ġ[": 933,
      "Ġcommun": 934,
      "Ġcre": 935,
      "ck": 936,
      "Ġdisc": 937,
      "arg": 938,
      "Ġtechn": 939,
      "Ġdata": 940,
      "chool": 941,
      "ĠRe": 942,
      "ices": 943,
      "Ġrequ": 944,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 945,
      "Ġcall": 946,
      "ically": 947,
      "Ġhum": 948,
      "other": 949,
      "..": 950,
      "ax": 951,
      "ential": 952,
      "Ġed": 953,
      "ars": 954,
      "Ġgra": 955,
      "iel": 956,
      "Ġmy": 957,
      "Ġmed": 958,
      "ward": 959,
      "ited": 960,
      "ruct": 961,
      "hat": 962,
      "Ġsee": 963,
      "Ġdet": 964,
      "Ġthen": 965,
      "Ġresult": 966,
      "Ġthose": 967,
      "ually": 968,
      "ages": 969,
      "Ġway": 970,
      "Ġeach": 971,
      "formation": 972,
      "Ġins": 973,
      "hip": 974,
      "Ġbecause": 975,
      "ection": 976,
      "Ġeffect": 977,
      "Ġbel": 978,
      "Ġwhile": 979,
      "Ġprocess": 980,
      "Ġduring": 981,
      "'t": 982,
      "Ġfound": 983,
      "Ġart": 984,
      "Ġcount": 985,
      "Ġlong": 986,
      "Ġpat": 987,
      "Ġdec": 988,
      "Ġfol": 989,
      "Ġafter": 990,
      "Ġgener": 991,
      "ron": 992,
      "Ġext": 993,
      "arm": 994,
      "meric": 995,
      "Ġcent": 996,
      "ety": 997,
      "ands": 998,
      "Ġincre": 999,
      "()": 1000,
      "Ġloc": 1001,
      "\",": 1002,
      "Ġreturn": 1003,
      "ĊĊĠĠĠ": 1004,
      "ized": 1005,
      "Ġdist": 1006,
      "led": 1007,
      "Ġprog": 1008,
      "iron": 1009,
      "ient": 1010,
      "Ġsk": 1011,
      "Ġread": 1012,
      "Ġent": 1013,
      "imes": 1014,
      "Ġusing": 1015,
      "Ġpartic": 1016,
      "Ġpub": 1017,
      "de": 1018,
      "arly": 1019,
      "Ġca": 1020,
      "Ġcur": 1021,
      "Ġlead": 1022,
      "Ġaut": 1023,
      "Ġrep": 1024,
      "els": 1025,
      "Ġhist": 1026,
      "Ġfact": 1027,
      "Ġtest": 1028,
      "Ġlife": 1029,
      "Ġcomple": 1030,
      "Ġfam": 1031,
      "ĠAs": 1032,
      "ivid": 1033,
      "ivers": 1034,
      "Ġvery": 1035,
      "Ġbeing": 1036,
      "Ġfun": 1037,
      "Ġown": 1038,
      "ning": 1039,
      "read": 1040,
      "Ġshe": 1041,
      "Ġfind": 1042,
      "ody": 1043,
      "Ġunderstand": 1044,
      "iqu": 1045,
      "ĠWe": 1046,
      "ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1047,
      "Ġright": 1048,
      "ases": 1049,
      "cent": 1050,
      "ork": 1051,
      "ĠAmeric": 1052,
      "ĠPro": 1053,
      "Ġresp": 1054,
      "Ġperson": 1055,
      "Ġback": 1056,
      "gg": 1057,
      "Ġstudents": 1058,
      "eng": 1059,
      "Ġdep": 1060,
      "ved": 1061,
      "Ġboth": 1062,
      "ather": 1063,
      "ality": 1064,
      "ĠAl": 1065,
      "Ġfollow": 1066,
      "Ġwrit": 1067,
      "ĠFor": 1068,
      "ĠThey": 1069,
      "Ġimportant": 1070,
      "ĠCon": 1071,
      "Ġdoes": 1072,
      "ĠHow": 1073,
      "Ġgl": 1074,
      "Ġgrow": 1075,
      "Ġcar": 1076,
      "ock": 1077,
      "put": 1078,
      "Ġmin": 1079,
      "tle": 1080,
      "ĠCom": 1081,
      "Th": 1082,
      "Ġmuch": 1083,
      "dition": 1084,
      "Ġmain": 1085,
      "Ġconf": 1086,
      "viron": 1087,
      "ix": 1088,
      "Ġche": 1089,
      "Ġappro": 1090,
      "Ġmon": 1091,
      "Ġbefore": 1092,
      "\"\"": 1093,
      "ĠIf": 1094,
      "par": 1095,
      "Ġinformation": 1096,
      "Ġsom": 1097,
      "Ġgrou": 1098,
      "ves": 1099,
      "Ġsol": 1100,
      "Ġsci": 1101,
      "Ġel": 1102,
      "ving": 1103,
      "inal": 1104,
      "Ġproble": 1105,
      "Ġlevel": 1106,
      "ional": 1107,
      "Ġstudy": 1108,
      "Ġgreat": 1109,
      "up": 1110,
      "any": 1111,
      "Ġend": 1112,
      "Ġav": 1113,
      "Ġfood": 1114,
      "Ġexperi": 1115,
      "ĊĊ": 1116,
      "ĠAn": 1117,
      "nce": 1118,
      "io": 1119,
      "Ġstart": 1120,
